app/controllers/listings_controller.rb

INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["description", "This is just a test"], ["price", 1.0], ["created_at", "2016-09-12 07:45:33.144209"], ["updated_at", "2016-09-12 07:45:33.144209"]]
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "description" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["description", "This is just a test. Let's add a revision."], ["updated_at", "2016-09-12 07:45:59.760732"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)